src/AccumulationRegisters/РасчетыПоЭквайрингу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоЭквайрингу</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлатежнойКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПлатежнойКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ВзаиморасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Comment>Документ оказания услуг, реализации товаров</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументАванса</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
						<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоАванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ДенежныеСредстваНаЛицевыхСчетах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваНаЛицевыхСчетах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<Comment>Денежные средства</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/СтатусыПланЛечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыПланЛечения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Рассматривается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отвергнут</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ДенежныеСредстваСервер/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

///////////////////////////////////////////////////////////////////////////////

// Процедура устанавливает видимость элементов формы по массиву имен.
//
// Параметры:
//	МассивВсехРеквизитов - Массив - Массив имен реквизитов, для которых устанавливается видимость
//	МассивВидимыхРеквизитов - Массив - Массив имен реквизитов, которые должны быть видны на форме.
//
Процедура УстановитьВидимостьЭлементовПоМассиву(Элементы, Знач МассивВсехРеквизитов, Знач МассивВидимыхРеквизитов) Экспорт
	
	Если ТипЗнч(МассивВидимыхРеквизитов) <> ТипЗнч(Новый Массив) Тогда
		МассивВидимыхРеквизитов = Новый Массив;
	КонецЕсли;
	
	Для Каждого ЭлементМассива Из МассивВсехРеквизитов Цикл
		
		Позиция = Найти(ЭлементМассива, ".");
		Если Позиция <> 0 Тогда
			ИмяРеквизита = СтрЗаменить(ЭлементМассива, ".", "");
		Иначе
			ИмяРеквизита = ЭлементМассива;
		КонецЕсли;
		
		// Если реквизита нет в массиве видимых реквизитов, снимаем видимость элемента формы.
		ВидимостьРеквизита = (МассивВидимыхРеквизитов.Найти(ЭлементМассива) <> Неопределено);
		Если Элементы.Найти(ИмяРеквизита) <> Неопределено
			И Элементы[ИмяРеквизита].Видимость <> ВидимостьРеквизита Тогда
			Элементы[ИмяРеквизита].Видимость = ВидимостьРеквизита;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // УстановитьВидимостьЭлементовПоМассиву()

// Процедура устанавливает доступность элементов формы по массиву имен.
//
// Параметры:
//	МассивВсехРеквизитов - Массив - Массив имен реквизитов, для которых устанавливается видимость
//	МассивВидимыхРеквизитов - Массив - Массив имен реквизитов, которые должны быть видны на форме.
//
Процедура УстановитьДоступностьЭлементовПоМассиву(Элементы, Знач МассивВсехРеквизитов, Знач МассивВидимыхРеквизитов) Экспорт
	
	Если ТипЗнч(МассивВидимыхРеквизитов) <> ТипЗнч(Новый Массив) Тогда
		МассивВидимыхРеквизитов = Новый Массив;
	КонецЕсли;
	
	Для Каждого ЭлементМассива Из МассивВсехРеквизитов Цикл
		
		Позиция = Найти(ЭлементМассива, ".");
		Если Позиция <> 0 Тогда
			ИмяРеквизита = СтрЗаменить(ЭлементМассива, ".", "");
		Иначе
			ИмяРеквизита = ЭлементМассива;
		КонецЕсли;
		
		// Если реквизита нет в массиве видимых реквизитов, снимаем видимость элемента формы.
		ДоступностьРеквизита = (МассивВидимыхРеквизитов.Найти(ЭлементМассива) <> Неопределено);
		Если Элементы.Найти(ИмяРеквизита) <> Неопределено
			И Элементы[ИмяРеквизита].Доступность <> ДоступностьРеквизита Тогда
			Элементы[ИмяРеквизита].Доступность = ДоступностьРеквизита;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // УстановитьДоступностьЭлементовПоМассиву()

// Процедура устанавливает видимость подбора по остаткам расчетов в форме.
//
// Параметры:
//	ВидОперации - ПеречислениеСсылка.ВидыОпераций - Хозяйственная операция документа
//	Кнопка - КнопкаФормы - Кнопка формы для открытия подбора
//
Процедура УстановитьВидимостьПодбораПоОстаткамРасчетов(ВидОперации, Кнопка) Экспорт
	
	МассивОпераций = Новый Массив;
	МассивОпераций.Добавить(Перечисления.ВидыОпераций.ВозвратОплатыОтПоставщика);
	МассивОпераций.Добавить(Перечисления.ВидыОпераций.ВозвратОплатыКлиенту);
	МассивОпераций.Добавить(Перечисления.ВидыОпераций.ОплатаПоставщику);
	МассивОпераций.Добавить(Перечисления.ВидыОпераций.ОплатаОтКлиента);
	// МассивОпераций.Добавить(Перечисления.ВидыОпераций.ВыдачаДенежныхСредствВДругуюОрганизацию);
	// МассивОпераций.Добавить(Перечисления.ВидыОпераций.ПеречислениеДенежныхСредствВДругуюОрганизацию);
	
	Кнопка.Видимость = (МассивОпераций.Найти(ВидОперации) <> Неопределено);
	
КонецПроцедуры // УстановитьВидимостьПодбораПоОстаткамРасчетов()

// Процедура устанавливает заголовок колонки "Сумма платежа".
//
// Параметры:
//	Валюта - СправочникСсылка.Валюты - Валюта документа
//	Элементы - ВсеЭлементыФормы - Коллекция элементов управляемой формы.
//
Процедура УстановитьЗаголовокСуммыПлатежа(Валюта, Элементы) Экспорт
	
	Элементы.РасшифровкаПлатежаСумма.Заголовок = "Сумма (" + Строка(Валюта) + ")";
	
КонецПроцедуры // УстановитьЗаголовокСуммыПлатежа()

// Процедура устанавливает заголовок колонки "Заказ".
//
// Параметры:
//	Валюта - СправочникСсылка.Валюты - Валюта документа
//	Элементы - ВсеЭлементыФормы - Коллекция элементов управляемой формы.
//
Процедура УстановитьЗаголовокКолонкиЗаказ(ВидОперации, ЭлементЗаказ) Экспорт
	
	Если ВидОперации = Перечисления.ВидыОпераций.ОплатаОтКлиента
		ИЛИ ВидОперации = Перечисления.ВидыОпераций.ВозвратОплатыКлиенту Тогда
		ЭлементЗаказ.Заголовок = "Заказ / Реализация";
	ИначеЕсли ВидОперации = Перечисления.ВидыОпераций.ВозвратОплатыСтраховойКомпании
		ИЛИ ВидОперации = Перечисления.ВидыОпераций.ПрочееСписание Тогда
		ЭлементЗаказ.Заголовок = "Документ расчетов";
	Иначе
		ЭлементЗаказ.Заголовок = "Заказ / Поступление";
	КонецЕсли;
	
КонецПроцедуры // УстановитьЗаголовокКолонкиЗаказ()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

///////////////////////////////////////////////////////////////////////////////

// Функция проверяет наличие заказа в табличной части "Расшифровка платежа" документа.
//
// Параметры:
//	Объект - ДанныеФормыСтруктура - Текущий объект
//
// Возвращаемое значение:
//	Булево - Истина - заказ указан в строке табличной части
//
Функция УказанЗаказВРасшифровкеПлатежа(Объект)
	
	ЗаказУказан = Ложь;
	Для Каждого СтрокаТаблицы Из Объект.РасшифровкаПлатежа Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.Заказ) Тогда
			ЗаказУказан = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЗаказУказан;
	
КонецФункции // УказанЗаказВРасшифровкеПлатежа()

// Процедура устанавливает параметры выбора для эквайрингового терминала.
//
// Параметры:
//	Объект - ДанныеФормыСтруктура - Текущий объект
//	ЭлементЭквайринговыйТерминал - ПолеФормы - Поле для ввода эквайрингового терминала.
//
Процедура УстановитьПараметрыВыбораЭквайринговогоТерминала(Объект, ЭлементЭквайринговыйТерминал) Экспорт
	
	Если Не ЗначениеЗаполнено(Объект.ЭквайринговыйТерминал)
		ИЛИ ЗначениеЗаполнено(Объект.ЗаявкаНаРасходованиеДенежныхСредств)
		ИЛИ УказанЗаказВРасшифровкеПлатежа(Объект) Тогда
		НуженОтборПоОрганизации = Истина;
	Иначе
		НуженОтборПоОрганизации = Ложь;
	КонецЕсли;
	
	Если НуженОтборПоОрганизации
		И ЗначениеЗаполнено(Объект.Организация)
		Тогда
		
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(Новый СвязьПараметраВыбора("Отбор.Организация", "Объект.Организация"));
		ЭлементЭквайринговыйТерминал.СвязиПараметровВыбора = Новый ФиксированныйМассив(МассивПараметров);
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьПараметрыВыбораЭквайринговогоТерминала()

// Процедура устанавливает параметры выбора для партнера.
//
// Параметры:
//	Объект - ДанныеФормыСтруктура - Текущий объект
//	ЭлементПартнер - ПолеФормы - Поле для ввода партнера.
//
Процедура УстановитьПараметрыВыбораПартнера(Объект, ЭлементПартнер) Экспорт
	
	МассивПараметров = Новый Массив;
	
	Если Объект.ВидОперации = Перечисления.ВидыОпераций.ОплатаОтКлиента
		ИЛИ Объект.ВидОперации = Перечисления.ВидыОпераций.ВозвратОплатыКлиенту
		Тогда
		МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Клиент", Истина));
	Иначе
		МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Поставщик", Истина));
	КонецЕсли;
	
	ЭлементПартнер.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	
КонецПроцедуры // УстановитьПараметрыВыбораПартнера()

// Процедура устанавливает параметры выбора для контрагента.
//
// Параметры:
//	Объект - ДанныеФормыСтруктура - Текущий объект
//	ЭлементКонтрагент - ПолеФормы - Поле для ввода контрагента.
//
Процедура УстановитьПараметрыВыбораКонтрагента(Объект, ЭлементКонтрагент) Экспорт
	
	МассивПараметров = Новый Массив;
	
	Если ЗначениеЗаполнено(Объект.Партнер) Тогда
		МассивПараметров.Добавить(Новый СвязьПараметраВыбора("Отбор.Партнер", "Объект.Партнер", РежимИзмененияСвязанногоЗначения.НеИзменять));
	КонецЕсли;
	
	ЭлементКонтрагент.СвязиПараметровВыбора = Новый ФиксированныйМассив(МассивПараметров);
	
КонецПроцедуры // УстановитьПараметрыВыбораКонтрагента()

// Процедура устанавливает параметры выбора для банковского счета контрагента.
//
// Параметры:
//	Объект - ДанныеФормыСтруктура - Текущий объект
//	ЭлементБанковскийСчетКонтрагента - ПолеФормы - Поле для ввода банковского счета контрагента.
//
Процедура УстановитьПараметрыВыбораБанковскогоСчетаКонтрагента(Объект, ЭлементБанковскийСчетКонтрагента) Экспорт
	
	МассивПараметров = Новый Массив;
	
	МассивПараметров.Добавить(Новый СвязьПараметраВыбора("Отбор.ВалютаДенежныхСредств", "Объект.Валюта"));
	Если Объект.ВидОперации = Перечисления.ВидыОпераций.ВыдачаПодотчетнику Тогда
		МассивПараметров.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.ПодотчетноеЛицо"));
	Иначе
		МассивПараметров.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент"));
	КонецЕсли;
	
	ЭлементБанковскийСчетКонтрагента.СвязиПараметровВыбора = Новый ФиксированныйМассив(МассивПараметров);
	
КонецПроцедуры // УстановитьПараметрыВыбораБанковскогоСчетаКонтрагента()

// Процедура устанавливает параметры выбора для заявки на расходование денежных средств.
//
// Параметры:
//	Объект - ДанныеФормыСтруктура - Текущий объект
//	ЭлементЗаявка - ПолеФормы - Поле для ввода заявки на расходование денежных средств.
//
Процедура УстановитьПараметрыВыбораЗаявки(Объект, ЭлементЗаявка) Экспорт
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый СвязьПараметраВыбора("Отбор.Организация", "Объект.Организация"));
	МассивПараметров.Добавить(Новый СвязьПараметраВыбора("Отбор.Валюта", "Объект.Валюта"));
	МассивПараметров.Добавить(Новый СвязьПараметраВыбора("Отбор.ВидОперации", "Объект.ВидОперации"));
	
	Если Объект.ВидОперации = Перечисления.ВидыОпераций.ВыдачаПодотчетнику Тогда
		МассивПараметров.Добавить(Новый СвязьПараметраВыбора("Отбор.ПодотчетноеЛицо", "Объект.ПодотчетноеЛицо"));
	КонецЕсли;
	
	ЭлементЗаявка.СвязиПараметровВыбора = Новый ФиксированныйМассив(МассивПараметров);
	
КонецПроцедуры // УстановитьПараметрыВыбораЗаявки()

// Процедура устанавливает ограничение типа для поля "Соглашение" табличной части.
//
// Параметры:
//	Объект - ДанныеФормыСтруктура - Текущий объект
//	ЭлементРасшифровкаПлатежаСоглашение - ПолеФормы - Поле для ввода соглашения.
//
Процедура УстановитьОграничениеТипаСоглашения(Объект, ЭлементРасшифровкаПлатежаСоглашение) Экспорт
	
	Если Объект.ВидОперации = Перечисления.ВидыОпераций.ОплатаОтКлиента
		ИЛИ Объект.ВидОперации = Перечисления.ВидыОпераций.ВозвратОплатыКлиенту Тогда
		ЭлементРасшифровкаПлатежаСоглашение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.СоглашенияСКлиентами");
	Иначе
		ЭлементРасшифровкаПлатежаСоглашение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.СоглашенияСПоставщиками");
	КонецЕсли;
	
КонецПроцедуры // УстановитьОграничениеТипаСоглашения()

// Процедура устанавливает ограничение типа для поля "Соглашение" табличной части.
//
// Параметры:
//	Объект - ДанныеФормыСтруктура - Текущий объект
//	ЭлементРасшифровкаПлатежаСоглашение - ПолеФормы - Поле для ввода соглашения.
//
Процедура УстановитьОграничениеТипаДокумента(Объект, ЭлементРасшифровкаПлатежаДокумент) Экспорт
	
	Если Объект.ВидОперации = Перечисления.ВидыОпераций.ОплатаОтКлиента Тогда
		ЭлементРасшифровкаПлатежаДокумент.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.Реализация");
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ВозвратПоставщику Тогда
		ЭлементРасшифровкаПлатежаДокумент.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.ВозвратПоставщику");
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ВозвратОплатыКлиенту Тогда
		ЭлементРасшифровкаПлатежаДокумент.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.ВозвратОтПокупателя");
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ОплатаПоставщику Тогда
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("ДокументСсылка.ЗаказПоставщику"));
		МассивТипов.Добавить(Тип("ДокументСсылка.Поступление"));
        ОграничениеТиповДокументов = Новый ОписаниеТипов(МассивТипов,,);
		ЭлементРасшифровкаПлатежаДокумент.ОграничениеТипа = ОграничениеТиповДокументов;
	КонецЕсли;
	
КонецПроцедуры // УстановитьОграничениеТипаСоглашения()

// Процедура очищает колонку табличной части "ЗаказРеализация"/"ЗаказПоступление".
//
// Параметры:
//	Объект - ДанныеФормыСтруктура - Текущий объект
//	ИмяКолонки - Строка - Имя колонки, которую будем очищать.
//
Процедура РасшифровкаПлатежаОчиститьКолонкуОснование(Объект, ИмяКолонки)  Экспорт
		Если Объект.РасшифровкаПлатежа.Количество() > 0 Тогда		
		Для Каждого СтрокаТабличнойЧасти Из Объект.РасшифровкаПлатежа Цикл
			Если ЗначениеЗаполнено(СтрокаТабличнойЧасти[ИмяКолонки]) Тогда
				Если СтрокаТабличнойЧасти[ИмяКолонки].Контрагент = Объект.Контрагент Тогда
					Возврат;
				Иначе
					СтрокаТабличнойЧасти[ИмяКолонки] = Неопределено;
					СтрокаТабличнойЧасти.Сумма = 0;
				КонецЕсли;
				Объект.СуммаДокумента = 0;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры // РасшифровкаПлатежаОчиститьКолонкуОснование()

///////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ЗАПОЛНЕНИЯ ДОКУМЕНТОВ.

// Процедура получает остатки денежных средств у подотчетника.
//
// Параметры:
//	ДокументСсылка - ДокументСсылка.АвансовыйОтчет - Текущий документ
//
Функция ПолучитьОстаткиДенежныхСредствУПодотчетника(
	ДокументСсылка
	) Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДенежныеСредства.РасчетныйДокумент КАК ДокументАванса,
	|	ДенежныеСредства.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.Остатки(
	|		&Дата,
	|		Организация = &Организация
	|		И ПодотчетноеЛицо = &ПодотчетноеЛицо
	|		И Валюта = &Валюта
	|	) КАК ДенежныеСредства
	|";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Дата", ДокументСсылка.Дата);
	Запрос.УстановитьПараметр("Организация", ДокументСсылка.Организация);
	Запрос.УстановитьПараметр("ПодотчетноеЛицо", ДокументСсылка.ПодотчетноеЛицо);
	Запрос.УстановитьПараметр("Валюта", ДокументСсылка.Валюта);
	
	РезультатЗапрос = запрос.Выполнить();
	ПолученныеАвансы = РезультатЗапрос.Выгрузить();
	
	Возврат ПолученныеАвансы;
	
КонецФункции // ПолучитьОстаткиДенежныхСредствУПодотчетника()

// Функция определяет партнера, соответствующего выбранному контрагенту.
//
// Возвращает ссылку котрагента, если найден один контрагент.
// Возвращает Неопределено, если контрагенты не найдены или контрагентов больше одного
//
// Параметры
//  Партнер		- ссылка на партнера, контрагента которого нужно найти
//
Функция ПолучитьПартнераПоКонтрагенту(Контрагент) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контрагенты.Партнер КАК Партнер
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Контрагент
	|");
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Партнер = Выборка.Партнер;
	Иначе
		Партнер = Неопределено;
	КонецЕсли;
	
	Возврат Партнер;
	
КонецФункции // ПолучитьПартнераПоКонтрагенту()

// Функция определяет реквизиты выбранной кассы.
//
// Параметры:
//  Касса - СправочникСсылка.Кассы - Ссылка на кассу
//
// Возвращаемое значение:
//	Структура - Организация и Валюта выбранной кассы
//
Функция ПолучитьРеквизитыКассы(Касса) Экспорт
	
	Возврат Справочники.Кассы.ПолучитьРеквизитыКассы(Касса);
	
КонецФункции // ПолучитьРеквизитыКассы()

// Процедура заполняет значения полей "БИК" и "КоррСчет".
//
Процедура ЗаполнитьБИКиКоррСчет(Банк, Бик, КоррСчет) Экспорт
	
	Если Не ЗначениеЗаполнено(Банк) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Код КАК БИК,
	|	КоррСчет КАК КоррСчет
	|ИЗ
	|	Справочник.Банки КАК Банки
	|ГДЕ
	|	Банки.Ссылка = &Ссылка
	|";
	Запрос.УстановитьПараметр("Ссылка", Банк);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Бик = Выборка.БИК;
		КоррСчет = Выборка.КоррСчет;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьБИКиКоррСчет()

// Процедура получает банк по указанному БИК или корреспондентскому счету.
//
// Параметры:
//	Поле - Строка - Имя поля, в котором произведен выбор значения.
//	Значение - Строка - Значение, выбранное в поле.
//	Банк - СправочникСсылка.Банки - Значение поля для указания банка
//	БИК - Строка - БИК банка
//	КоррСчет - Строка - Корреспондентский счет банка
//
// Возвращаемое значение:
//	СписокЗначений - Список банков для интерактивного выбора.
//
Функция ПолучитьСписокБанковПоРеквизитам(
	Поле,
	Значение,
	Банк,
	БИК,
	КоррСчет
	) Экспорт
	
	СписокБанков = Новый СписокЗначений;
	
	// Если значение не выбрано, очистим значение банка.
	Если ПустаяСтрока(Значение) Тогда
		
		Банк = Справочники.Банки.ПустаяСсылка();
		БИК = "";
		КоррСчет = "";
		
		Возврат СписокБанков;
		
	КонецЕсли;
	
	ТаблицаБанков = Справочники.Банки.ПолучитьТаблицуБанковПоРеквизитам(
	Поле,
	Значение
	);
	Если ТаблицаБанков.Количество() = 1 Тогда
		ДанныеБанка = ТаблицаБанков[0];
		
		Банк = ДанныеБанка.Ссылка;
		БИК = ДанныеБанка.Код;
		КоррСчет = ДанныеБанка.КоррСчет;
		СписокБанков.Добавить(Банк);
		
	Иначе
		МассивБанков = ТаблицаБанков.ВыгрузитьКолонку("Ссылка");
		СписокБанков.ЗагрузитьЗначения(МассивБанков);
		
	КонецЕсли;
	
	Возврат СписокБанков;
	
КонецФункции // ПолучитьСписокБанковПоРеквизитам()

///////////////////////////////////////////////////////////////////////////////

// Функция помещает расшифровку платежа во временное хранилище и возвращает адрес.
//
Функция ПоместитьРасшифровкуПлатежаВХранилище(Знач РасшифровкаПлатежа, УникальныйИдентификатор) Экспорт
	
	АдресПлатежейВХранилище = ПоместитьВоВременноеХранилище(
	РасшифровкаПлатежа.Выгрузить(,"Соглашение, Заказ, Сумма, ВалютаВзаиморасчетов, СуммаВзаиморасчетов"),
	УникальныйИдентификатор
	);
	
	Возврат АдресПлатежейВХранилище;
	
КонецФункции // ПоместитьРасшифровкуПлатежаВХранилище()

// Функция формирует текст строки "В том числе НДС" платежа.
//
// Параметры:
// Возвращаемое значение:
//	СуммаДокумента - Число - Общая сумма документа
//	МассивДокументов - Массив - Массив документов для определения суммы НДС
//	ДобавлятьТекстВТомЧисле - Булево - Добавлять строку "В т.ч." в текст платежа
//
// Возвращаемое значение:
//	Строка - Текст суммы НДС платежа
//
Функция ТекстСуммаНДСПлатежа(СуммаДокумента, Валюта, МассивДокументов, ДобавлятьТекстВТомЧисле) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	Товары.СтавкаНДС КАК СтавкаНДС,
	                      |	СУММА(Товары.Сумма) КАК Сумма,
	                      |	СУММА(Товары.СуммаНДС) КАК СуммаНДС
	                      |ИЗ
	                      |	Документ.ВозвратПоставщику.Запасы КАК Товары
	                      |ГДЕ
	                      |	Товары.Ссылка В(&МассивДокументов)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Товары.СтавкаНДС
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	Товары.СтавкаНДС,
	                      |	СУММА(Товары.Сумма),
	                      |	СУММА(Товары.СуммаНДС)
	                      |ИЗ
	                      |	Документ.Реализация.Запасы КАК Товары
	                      |ГДЕ
	                      |	Товары.Ссылка В(&МассивДокументов)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Товары.СтавкаНДС
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	СтавкаНДС
	                      |ИТОГИ
	                      |	СУММА(Сумма)
	                      |ПО
	                      |	ОБЩИЕ");
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	ТаблицаНДС = Новый ТаблицаЗначений;
	ТаблицаНДС.Колонки.Добавить("СтавкаНДС");
	ТаблицаНДС.Колонки.Добавить("Сумма");
	ТаблицаНДС.Колонки.Добавить("СуммаНДС");
	
	СуммаВсего = 0;
	СуммаКРаспределению = СуммаДокумента;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ТипЗаписи() = ТипЗаписиЗапроса.ОбщийИтог Тогда
			СуммаВсего = Выборка.Сумма;
		Иначе
			СтавкаНДСЧисло = Ценообразование.ПолучитьСтавкуНДС(Выборка.СтавкаНДС) * 100;
			
			Если СтавкаНДСЧисло <> 0 Тогда
				НоваяСтрока = ТаблицаНДС.Добавить();
				НоваяСтрока.СтавкаНДС = Выборка.СтавкаНДС;
				НоваяСтрока.Сумма = ?(СуммаВсего <> 0, ОКР(СуммаКРаспределению * Выборка.Сумма / СуммаВсего, 2, 1), 0);
				// НоваяСтрока.Сумма - (НоваяСтрока.Сумма) / ((СтавкаНДСЧисло + 100)/100);
				НоваяСтрока.СуммаНДС = (НоваяСтрока.Сумма) / ((СтавкаНДСЧисло + 100)/100);
				СуммаКРаспределению = СуммаКРаспределению - НоваяСтрока.Сумма;
			КонецЕсли;
			
			СуммаВсего = СуммаВсего - Выборка.Сумма;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТаблицаНДС.Количество() > 0 Тогда
		// ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("ВалютаРегламентированногоУчета");
		ВалютаРегламентированногоУчета = Справочники.Валюты.ПолучитьСсылку();
		ТекстНазначениеПлатежаНДС = "";
		
		Для Каждого СтрокаТаблицы Из ТаблицаНДС Цикл
			ТекстНазначениеПлатежаНДС = ТекстНазначениеПлатежаНДС
			+ ?(ПустаяСтрока(ТекстНазначениеПлатежаНДС), "", ", ")
			+ "НДС(" + СтрокаТаблицы.СтавкаНДС + ") "
			+ Формат(СтрокаТаблицы.СуммаНДС, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ=")
			+ ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти();
		КонецЦикла;
		
		Если ДобавлятьТекстВТомЧисле Тогда
			ТекстНазначениеПлатежаНДС = "В т.ч. " + ТекстНазначениеПлатежаНДС;
		КонецЕсли;
		
	Иначе
		ТекстНазначениеПлатежаНДС = "Без налога (НДС)";
	КонецЕсли;
	
	Возврат ТекстНазначениеПлатежаНДС;
	
КонецФункции // ТекстСуммаНДСПлатежа()

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПРОВЕРКИ ЗАПОЛНЕНИЯ ДОКУМЕНТОВ.

// Процедура проверяет заполнение табличной части "Расшифровка платежа".
//
// Параметры:
//	ДокументОбъект - Документ
//	СуммаДокумента - Число - Общая сумма документа
//	ВидОперации - ПеречислениеСсылка.ВидыОпераций - Хозяйственная операция документа
//	Отказ - Булево - Признак отказа от продолжения работы
//
Процедура ПроверитьЗаполнениеРасшифровкиПлатежа(
	ДокументОбъект,
	СуммаДокумента,
	ВидОперации,
	Отказ
	) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивНепроверяемыхОпераций = Новый Массив;
	МассивНепроверяемыхОпераций.Добавить(Перечисления.ВидыОпераций.ПоступлениеИзБанка);
	МассивНепроверяемыхОпераций.Добавить(Перечисления.ВидыОпераций.СдачаНаличныхВБанк);
	 
	Если МассивНепроверяемыхОпераций.Найти(ВидОперации) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим соответствие сумм документа и табличной части.
	Если ДокументОбъект.РасшифровкаПлатежа.Количество() > 0 
		И СуммаДокумента <> ДокументОбъект.РасшифровкаПлатежа.Итог("Сумма") Тогда
		
		Текст = НСтр("ru = 'Сумма по строкам в табличной части должна равняться сумме документа!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		Текст,
		ДокументОбъект,
		"РасшифровкаПлатежа[0].Сумма",
		,
		Отказ
		);
		
	КонецЕсли;
	
	// Проверка проведенности документов основания в ТЧ
	Счетчик = 0;
	Для Каждого СтрокаТЧ ИЗ ДокументОбъект.РасшифровкаПлатежа Цикл
		
		Если ЗначениеЗаполнено(СтрокаТЧ.ДокументОснования) И НЕ СтрокаТЧ.ДокументОснования.Проведен Тогда
			
			Текст = НСтр("ru = 'Документ находящийся в основании не проведен!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			Текст,
			ДокументОбъект,
			"РасшифровкаПлатежа["+Счетчик+"].ДокументОснования",
			,
			Отказ
			);
			                                                                                 
			Прервать;
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
	
КонецПроцедуры // ПроверитьЗаполнениеРасшифровкиПлатежа()

// Процедура проверяет банковский счет получатель, указанный в документе.
//
// Параметры:
//	ДокументОбъект - Текущий документ
//	Отказ - Булево - Признак отказа от продолжения работы
//
Процедура ПроверитьБанковскийСчетПолучатель(ДокументОбъект, Операция, Отказ) Экспорт
	
	Если ДокументОбъект.ВидОперации = Операция Тогда
		Если Не ЗначениеЗаполнено(ДокументОбъект.БанковскийСчетПолучатель) Тогда
			Текст = НСтр("ru = 'Поле ""Получатель"" не заполнено'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			Текст,
			ДокументОбъект,
			"БанковскийСчетПолучатель",
			,
			Отказ
			);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПроверитьБанковскийСчетПолучатель()

// Процедура очищает неиспользуемые для хозяйственной операции реквизиты.
//
// Параметры:
//	ДокументОбъект - ДокументОбъект - Текущий документ
//	МассивВсехРеквизитов - Массив - Массив всех реквизитов документа, которые необходимо очищать
// МассивРеквизитовОперации - Массив - Массив реквизитов документа, которые относятся к хозяйственной операции документа
//
Процедура ОчиститьНеиспользуемыеРеквизиты(ДокументОбъект, Знач МассивВсехРеквизитов, Знач МассивРеквизитовОперации) Экспорт
	
	// Удалим из массива реквизиты, относящиеся к хозяйственной операции.
	Для Каждого ЭлементМассива Из МассивРеквизитовОперации Цикл
		
		Номер = МассивВсехРеквизитов.Найти(ЭлементМассива);
		Если Номер <> Неопределено Тогда
			МассивВсехРеквизитов.Удалить(Номер);
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураТабличныхЧастей = Новый Структура;
	
	Для Каждого ЭлементМассива Из МассивВсехРеквизитов Цикл
		
		Позиция = Найти(ЭлементМассива, ".");
		
		// Реквизит табличной части.
		Если Позиция <> 0 Тогда
			ИмяТабличнойЧасти = Лев(ЭлементМассива, Позиция - 1);
			РеквизитыТабличнойЧасти = Неопределено;
			Если Не СтруктураТабличныхЧастей.Свойство(ИмяТабличнойЧасти, РеквизитыТабличнойЧасти) Тогда
				СтруктураТабличныхЧастей.Вставить(ИмяТабличнойЧасти, Новый Массив);
				РеквизитыТабличнойЧасти = СтруктураТабличныхЧастей[ИмяТабличнойЧасти];
			КонецЕсли;
			РеквизитыТабличнойЧасти.Добавить(Сред(ЭлементМассива, Позиция + 1));
			
			// Для табличной части ничего не делаем.	
		ИначеЕсли ЭлементМассива = "РасшифровкаПлатежа" Тогда 
			
			// Реквизит шапки.	
		Иначе
			Если ЗначениеЗаполнено(ДокументОбъект[СокрЛП(ЭлементМассива)]) Тогда
				ДокументОбъект[СокрЛП(ЭлементМассива)] = Неопределено;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Очистим необходимые реквизиты табличной части.
	Если СтруктураТабличныхЧастей.Количество() > 0 Тогда
		
		Для Каждого ТабличнаяЧасть ИЗ СтруктураТабличныхЧастей Цикл
			
			Для Каждого СтрокаТаблицы Из ДокументОбъект[ТабличнаяЧасть.Ключ] Цикл
				
				Для Каждого ЭлементМассива Из ТабличнаяЧасть.Значение Цикл
					Если ЗначениеЗаполнено(СтрокаТаблицы[СокрЛП(ЭлементМассива)]) Тогда
						СтрокаТаблицы[СокрЛП(ЭлементМассива)] = Неопределено;
					КонецЕсли;
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ОчиститьНеиспользуемыеРеквизиты()

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ПО ДЕНЕЖНЫМ СРЕДСТВАМ.

// Процедура формирования движений по регистру "Денежные средства (наличные)".
//
// Параметры:
//	ДокументОбъект - Текущий документ
//	Отказ - Булево - Признак отказа от проведения документа
//
Процедура ОтразитьДенежныеСредстваНаличные(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДенежныеСредства = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДенежныеСредстваНаличные;
	
	Если Отказ ИЛИ ТаблицаДенежныеСредства.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДвиженияДенежныеСредства = Движения.ДенежныеСредстваНаличные;
	ДвиженияДенежныеСредства.Записывать = Истина;
	ДвиженияДенежныеСредства.Загрузить(ТаблицаДенежныеСредства);
	
КонецПроцедуры // ОтразитьДенежныеСредстваНаличные()

// Процедура формирования движений по регистру "Денежные средства (наличные)".
//
// Параметры:
//	ДокументОбъект - Текущий документ
//	Отказ - Булево - Признак отказа от проведения документа
//
Процедура ОтразитьДенежныеСредстваВКассах(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	// ТаблицаДенежныеСредства = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДенежныеСредстваВКассахККМ;
	//
	// Если Отказ ИЛИ ТаблицаДенежныеСредства.Количество() = 0 Тогда
	//	
	//	Возврат;
	//	
	// КонецЕсли;
	//
	// ДвиженияДенежныеСредства = Движения.ДенежныеСредстваВКассахККМ;
	// ДвиженияДенежныеСредства.Записывать = Истина;
	// ДвиженияДенежныеСредства.Загрузить(ТаблицаДенежныеСредства);
	
КонецПроцедуры // ОтразитьДенежныеСредстваВКассах()

// Процедура формирования движений по регистру "Денежные средства (безналичные)".
//
// Параметры:
//	ДокументОбъект - Текущий документ
//	Отказ - Булево - Признак отказа от проведения документа
//
Процедура ОтразитьДенежныеСредстваБезналичные(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДенежныеСредства = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДенежныеСредстваБезналичные;
	
	Если Отказ ИЛИ ТаблицаДенежныеСредства.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДвиженияДенежныеСредства = Движения.ДенежныеСредстваБезналичные;
	ДвиженияДенежныеСредства.Записывать = Истина;
	ДвиженияДенежныеСредства.Загрузить(ТаблицаДенежныеСредства);
	
КонецПроцедуры // ОтразитьДенежныеСредстваБезналичные()

// Процедура формирования движений по регистру "Денежные средства к поступлению (наличные)".
//
// Параметры:
//	ДокументОбъект - Текущий документ
//	Отказ - Булево - Признак отказа от проведения документа
//
Процедура ОтразитьДенежныеСредстваКПоступлениюНаличные(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДенежныеСредства = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДенежныеСредстваКПоступлениюНаличные;
	
	Если Отказ ИЛИ ТаблицаДенежныеСредства.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДвиженияДенежныеСредства = Движения.ДенежныеСредстваКПоступлениюНаличные;
	ДвиженияДенежныеСредства.Записывать = Истина;
	ДвиженияДенежныеСредства.Загрузить(ТаблицаДенежныеСредства);
	
КонецПроцедуры // ОтразитьДенежныеСредстваКПоступлениюНаличные()

// Процедура формирования движений по регистру "Денежные средства к списанию (наличные)".
//
// Параметры:
//	ДокументОбъект - Текущий документ
//	Отказ - Булево - Признак отказа от проведения документа
//
Процедура ОтразитьДенежныеСредстваКСписаниюНаличные(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДенежныеСредства = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДенежныеСредстваКСписаниюНаличные;
	
	Если Отказ ИЛИ ТаблицаДенежныеСредства.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДвиженияДенежныеСредства = Движения.ДенежныеСредстваКСписаниюНаличные;
	ДвиженияДенежныеСредства.Записывать = Истина;
	ДвиженияДенежныеСредства.Загрузить(ТаблицаДенежныеСредства);
	
КонецПроцедуры // ОтразитьДенежныеСредстваКСписаниюНаличные()

// Процедура формирования движений по регистру "Денежные средства к поступлению (безналичные)".
//
// Параметры:
//	ДокументОбъект - Текущий документ
//	Отказ - Булево - Признак отказа от проведения документа
//
Процедура ОтразитьДенежныеСредстваКПоступлениюБезналичные(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДенежныеСредства = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДенежныеСредстваКПоступлениюБезналичные;
	
	Если Отказ ИЛИ ТаблицаДенежныеСредства.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДвиженияДенежныеСредства = Движения.ДенежныеСредстваКПоступлениюБезналичные;
	ДвиженияДенежныеСредства.Записывать = Истина;
	ДвиженияДенежныеСредства.Загрузить(ТаблицаДенежныеСредства);
	
КонецПроцедуры // ОтразитьДенежныеСредстваКПоступлениюБезналичные()

// Процедура формирования движений по регистру "Денежные средства к списанию (безналичные)".
//
// Параметры:
//	ДокументОбъект - Текущий документ
//	Отказ - Булево - Признак отказа от проведения документа
//
Процедура ОтразитьДенежныеСредстваКСписаниюБезналичные(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДенежныеСредства = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДенежныеСредстваКСписаниюБезналичные;
	
	Если Отказ ИЛИ ТаблицаДенежныеСредства.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДвиженияДенежныеСредства = Движения.ДенежныеСредстваКСписаниюБезналичные;
	ДвиженияДенежныеСредства.Записывать = Истина;
	ДвиженияДенежныеСредства.Загрузить(ТаблицаДенежныеСредства);
	
КонецПроцедуры // ОтразитьДенежныеСредстваКСписаниюБезналичные()

// Процедура формирования движений по регистру "Денежные средства у подотчетных лиц".
//
// Параметры:
//	ДокументОбъект - Текущий документ
//	Отказ - Булево - Признак отказа от проведения документа
//
Процедура ОтразитьДенежныеСредстваУПодотчетныхЛиц(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДенежныеСредства = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДенежныеСредстваУПодотчетныхЛиц;
	
	Если Отказ ИЛИ ТаблицаДенежныеСредства.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДвиженияДенежныеСредства = Движения.ДенежныеСредстваУПодотчетныхЛиц;
	ДвиженияДенежныеСредства.Записывать = Истина;
	ДвиженияДенежныеСредства.Загрузить(ТаблицаДенежныеСредства);
	
КонецПроцедуры // ОтразитьДенежныеСредстваУПодотчетныхЛиц()

// Процедура формирования движений по регистру "Денежные средства к списанию с подотчетных лиц".
//
// Параметры:
//	ДокументОбъект - Текущий документ
//	Отказ - Булево - Признак отказа от проведения документа
//
Процедура ОтразитьДенежныеСредстваКСписаниюСПодотчетныхЛиц(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДенежныеСредства = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДенежныеСредстваКСписаниюСПодотчетныхЛиц;
	
	Если Отказ ИЛИ ТаблицаДенежныеСредства.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДвиженияДенежныеСредства = Движения.ДенежныеСредстваКСписаниюСПодотчетныхЛиц;
	ДвиженияДенежныеСредства.Записывать = Истина;
	ДвиженияДенежныеСредства.Загрузить(ТаблицаДенежныеСредства);
	
КонецПроцедуры // ОтразитьДенежныеСредстваКСписаниюСПодотчетныхЛиц()

// Процедура формирования движений по регистру "Денежные средства к выплате".
//
// Параметры:
//	ДокументОбъект - Текущий документ
//	Отказ - Булево - Признак отказа от проведения документа
//
Процедура ОтразитьДенежныеСредстваКВыплате(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДенежныеСредства = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДенежныеСредстваКВыплате;
	
	Если Отказ ИЛИ ТаблицаДенежныеСредства.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДвиженияДенежныеСредства = Движения.ДенежныеСредстваКВыплате;
	ДвиженияДенежныеСредства.Записывать = Истина;
	ДвиженияДенежныеСредства.Загрузить(ТаблицаДенежныеСредства);
	
КонецПроцедуры // ОтразитьДенежныеСредстваКВыплате()

// Процедура формирования движений по регистру "Расчеты по эквайрингу".
//
// Параметры:
//	ДокументОбъект - Текущий документ
//	Отказ - Булево - Признак отказа от проведения документа
//
Процедура ОтразитьРасчетыПоЭквайрингу(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаРасчетыПоЭквайрингу = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетыПоЭквайрингу;
	
	Если Отказ ИЛИ ТаблицаРасчетыПоЭквайрингу.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДвиженияДенежныеСредства = Движения.РасчетыПоЭквайрингу;
	ДвиженияДенежныеСредства.Записывать = Истина;
	ДвиженияДенежныеСредства.Загрузить(ТаблицаРасчетыПоЭквайрингу);
	
КонецПроцедуры // ОтразитьРасчетыПоЭквайрингу()

///////////////////////////////////////////////////////////////////////////////

// Процедура заполняет массив непроверяемых реквизитов значениями,
// не используемыми при выбранной хозяйственной операции документа.
//
// Параметры:
// МассивВсехРеквизитов - Массив - Массив всех реквизитов документа
// МассивРеквизитовОперации - Массив - Массив реквизитов документа, которые относятся к хозяйственной операции документа
// МассивНепроверяемыхРеквизитов - Массив реквизитов объекта, не требующих проверки
//
Процедура ЗаполнитьМассивНепроверяемыхРеквизитов(МассивВсехРеквизитов, МассивРеквизитовОперации, МассивНепроверяемыхРеквизитов) Экспорт
	
	Для Каждого ЭлементМассива Из МассивВсехРеквизитов Цикл
		
		// Если реквизит не используется для хозяйственной операции, исключаем данный реквизит из проверки.
		Если МассивРеквизитовОперации.Найти(ЭлементМассива) = Неопределено Тогда
			МассивНепроверяемыхРеквизитов.Добавить(ЭлементМассива);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьМассивНепроверяемыхРеквизитов()    

// Процедура заполняет массив непроверяемых реквизитов значениями,
// не используемыми при выбранной хозяйственной операции документа.
//
// Параметры:
// МассивВсехРеквизитов - Массив - Массив всех реквизитов документа
// МассивРеквизитовОперации - Массив - Массив реквизитов документа, которые относятся к хозяйственной операции документа
// МассивНепроверяемыхРеквизитов - Массив реквизитов объекта, не требующих проверки
//
Процедура ЗаполнитьМассивНепроверяемыхРеквизитовПоОбъекту(ПроверяемыйОбъект, МассивОбязательныхРеквизитов, МассивНепроверяемыхРеквизитов) Экспорт
	
	// ПроверяемыйОбъект.Метаданные().ТабличныеЧасти.РасшифровкаПлатежа.Реквизиты
	МетаданныеОбъекта = ПроверяемыйОбъект.Метаданные();
	
	Для Каждого РеквизитМ Из МетаданныеОбъекта.Реквизиты Цикл
		
		// Если реквизит не используется для хозяйственной операции, исключаем данный реквизит из проверки.
		Если МассивОбязательныхРеквизитов.Найти(РеквизитМ.Имя) = Неопределено Тогда
			МассивНепроверяемыхРеквизитов.Добавить(РеквизитМ.Имя);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ТабличнаяЧастьМ Из МетаданныеОбъекта.ТабличныеЧасти Цикл
		
		// Если реквизит не используется для хозяйственной операции, исключаем данный реквизит из проверки.
		Если МассивОбязательныхРеквизитов.Найти(ТабличнаяЧастьМ.Имя) = Неопределено Тогда
			МассивНепроверяемыхРеквизитов.Добавить(ТабличнаяЧастьМ.Имя);
		КонецЕсли;
		
		Для Каждого РеквизитТЧ ИЗ ТабличнаяЧастьМ.Реквизиты Цикл
			// Если реквизит не используется для хозяйственной операции, исключаем данный реквизит из проверки.
			Если МассивОбязательныхРеквизитов.Найти(ТабличнаяЧастьМ.Имя +"."+ РеквизитТЧ.Имя) = Неопределено Тогда
				МассивНепроверяемыхРеквизитов.Добавить(ТабличнаяЧастьМ.Имя +"."+ РеквизитТЧ.Имя);
			КонецЕсли;
			
		КонецЦикла;	
			
	КонецЦикла;
	
КонецПроцедуры

// Процедура удаляет из массива элементы, соответствующие именам не проверяемых реквизитов объекта.
//
// Параметры:
//	МассивРеквизитов - Массив - Массив реквизитов объекта
//	МассивНепроверяемыхРеквизитов - Массив реквизитов объекта, не требующих проверки
//
Процедура УдалитьНепроверяемыеРеквизитыИзМассива(МассивРеквизитов, МассивНепроверяемыхРеквизитов) Экспорт
	
	Для Каждого ЭлементМассива Из МассивНепроверяемыхРеквизитов Цикл
		
		ПорядковыйНомер = МассивРеквизитов.Найти(ЭлементМассива);
		Если ПорядковыйНомер <> Неопределено Тогда
			МассивРеквизитов.Удалить(ПорядковыйНомер);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // УдалитьНепроверяемыеРеквизитыИзМассива()

// Процедура пересчитывает сумму в строке табличной части "Расшифровка платежа" при изменении суммы в шапке документа.
//
// Параметры:
//	Объект - ДанныеФормыСтруктура - Текущий документ
//	СуммаДокумента - Число - Сумма документа
//
Процедура ПересчетСуммыВСтрокеРасшифровкиПлатежа(Объект, СуммаДокумента) Экспорт
	
	Если Объект.РасшифровкаПлатежа.Количество() = 1 Тогда
		
		СтрокаТаблицы = Объект.РасшифровкаПлатежа[0];
		СтрокаТаблицы.Сумма = СуммаДокумента;
		
	КонецЕсли;
	
КонецПроцедуры // ПересчетСуммыВСтрокеРасшифровкиПлатежа()

// Процедура заполняет реквизит ОплаченоФакт документа продажи, по данным документа оплаты
Процедура ЗаполнитьРеквизитыОплатыДокументаОснования(ДокументОплаты, УдалениеПроведения = Ложь) Экспорт
	
	Если ТипЗнч(ДокументОплаты) = Тип("ДокументОбъект.Прием") Тогда
				
		Если НЕ УдалениеПроведения Тогда
			ДокументОбъект               = ДокументОплаты;						
			
			// Перезаполняем реквизиты
			ДокументОбъект.СуммаОплачено = РегистрыНакопления.ВзаиморасчетыСКонтрагентами.ПолучитьСуммуОплатыПоДокументу(ДокументОплаты.Ссылка);
			// Порою возникает проблема при уст. этого реквизита....
			// ДокументОбъект.Долговой      = ДокументОбъект.СуммаОплачено < ДокументОбъект.СуммаДокумента;
			Если ДокументОплаты.Ссылка.СуммаОплачено <> ДокументОбъект.СуммаОплачено 
				ИЛИ (ДокументОплаты.Ссылка.Долговой <> ДокументОбъект.Долговой) Тогда
				ДокументОбъект.ДополнительныеСвойства.Вставить("НеПроверятьДатыЗапретаИзмененияДанных", Истина);
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;	
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДокументОплаты) <> Тип("ДокументОбъект.ВозвратОтПокупателя") Тогда		
		// Прекратить операцию если выставлен флаг блокировки обработки
		Если (ТипЗнч(ДокументОплаты) = ТИп("ДокументОбъект.СписаниеДенежныхСредств") ИЛИ 
			ТипЗнч(ДокументОплаты) = ТИп("ДокументОбъект.ПоступлениеДенежныхСредств")) И
			ДокументОплаты.БлокировкаОбработчикаКорректировкиДокументовОснования = Истина Тогда
			Возврат;
		КонецЕсли;	
	
		РасшифровкаПлатежа = ДокументОплаты.РасшифровкаПлатежа;	
		Для А = 0 По РасшифровкаПлатежа.Количество()-1 Цикл		
			Если ЗначениеЗаполнено(РасшифровкаПлатежа[А].ДокументОснования)  Тогда		
				Если ТипЗнч(РасшифровкаПлатежа[А].ДокументОснования) = Тип("ДокументСсылка.Прием")
					ИЛИ ТипЗнч(РасшифровкаПлатежа[А].ДокументОснования) = Тип("ДокументСсылка.Реализация")	
					ИЛИ ТипЗнч(РасшифровкаПлатежа[А].ДокументОснования) = Тип("ДокументСсылка.ВозвратОтПокупателя") 
					ИЛИ ТипЗнч(РасшифровкаПлатежа[А].ДокументОснования) = Тип("ДокументСсылка.ПланЛечения") 
					ИЛИ ТипЗнч(РасшифровкаПлатежа[А].ДокументОснования) = Тип("ДокументСсылка.Поступление")
					ИЛИ ТипЗнч(РасшифровкаПлатежа[А].ДокументОснования) = Тип("ДокументСсылка.ЗаказПоставщику")
					ИЛИ ТипЗнч(РасшифровкаПлатежа[А].ДокументОснования) = Тип("ДокументСсылка.ВозвратПоставщику") Тогда
					ДокументОбъект               = РасшифровкаПлатежа[А].ДокументОснования.ПолучитьОбъект();
					// Получаем ост. задолженности по взаиморасчетам
					
					Если ТипЗнч(РасшифровкаПлатежа[А].ДокументОснования) = Тип("ДокументСсылка.ВозвратОтПокупателя") 
						И ЗначениеЗаполнено(РасшифровкаПлатежа[А].ДокументОснования.ДокументОснования) Тогда
						ДокументОснования = РасшифровкаПлатежа[А].ДокументОснования.ДокументОснования;
					Иначе
						ДокументОснования = РасшифровкаПлатежа[А].ДокументОснования;
					КонецЕсли;
						
					// Обновляем значение реквизита сумма оплачено
					Если ОбщегоНазначенияСтоматология.ЕстьРеквизитДокумента("СуммаОплачено", ДокументОбъект.Метаданные()) Тогда
						
						Если ТипЗнч(РасшифровкаПлатежа[А].ДокументОснования) = Тип("ДокументСсылка.Прием")
							ИЛИ ТипЗнч(РасшифровкаПлатежа[А].ДокументОснования) = Тип("ДокументСсылка.Реализация") Тогда
							
							СуммаОплаченоПоДокументу = РегистрыНакопления.ВзаиморасчетыСКонтрагентами.ПолучитьСуммуОплатыПоДокументу(ДокументОснования);
						Иначе
							
							НеУчитыватьДвижения = ?(УдалениеПроведения, ДокументОплаты.Ссылка, Неопределено);
							ОстатокЗадолженности = РегистрыНакопления.ВзаиморасчетыСКонтрагентами.ПолучитьЗадолженностьПоДокументу(ДокументОснования, Неопределено, НеУчитыватьДвижения, Истина);							
							
							Если НЕ РасшифровкаПлатежа[А].ДокументОснования.Проведен Тогда
								ОстатокЗадолженности = ДокументОбъект.СуммаДокумента - ОстатокЗадолженности * -1;
							КонецЕсли;	
							Если ТипЗнч(РасшифровкаПлатежа[А].ДокументОснования) = Тип("ДокументСсылка.ВозвратОтПокупателя") 
								И ЗначениеЗаполнено(РасшифровкаПлатежа[А].ДокументОснования.ДокументОснования) Тогда	
								ОстатокЗадолженности = ОстатокЗадолженности * -1;		
							КонецЕсли;
							
							СуммаОплаченоПоДокументу = ДокументОбъект.СуммаДокумента - ОстатокЗадолженности;
							
						КонецЕсли;
						
						Если ДокументОбъект.СуммаОплачено = СуммаОплаченоПоДокументу Тогда
							Продолжить;
						КонецЕсли;	
						ДокументОбъект.СуммаОплачено = СуммаОплаченоПоДокументу; 	
						Если ОбщегоНазначенияСтоматология.ЕстьРеквизитДокумента("Долговой", ДокументОбъект.Метаданные()) Тогда
							ДокументОбъект.Долговой  = ДокументОбъект.СуммаОплачено < ДокументОбъект.СуммаДокумента;
						КонецЕсли;
					КонецЕсли;
					// Установки строку видов оплаты документа
					МассивДокументов             = ПолучитьДокументыОплатыПоДокументуРеализации(РасшифровкаПлатежа[А].ДокументОснования,,ДокументОплаты.ВидОперации);
					МассивВидов                  = Новый Массив;
					ВидыОплатыСтрокой            = "";
					// Подготовка массива видов оплат из документов оплат
					Для Каждого ДокументСсылка ИЗ МассивДокументов Цикл
						Если СтрЧислоВхождений(ВидыОплатыСтрокой,ДокументСсылка.ТипДенежныхСредств)>0 ИЛИ УдалениеПроведения И ДокументСсылка = ДокументОплаты.Ссылка Тогда
							Продолжить;
						КонецЕсли;
						ТипДенежныхСредствСтрокой = Строка(ДокументСсылка.ТипДенежныхСредств);
						ТипДенежныхСредствСтрокой = ТипДенежныхСредствСтрокой + ?(ДокументСсылка.ВидОперации = Перечисления.ВидыОпераций.ОплатаОтСтраховойКомпании,": Страховая компания {"+ДокументСсылка.Контрагент+"}","");
						ВидыОплатыСтрокой         = ВидыОплатыСтрокой + ТипДенежныхСредствСтрокой+",";
						МассивВидов.Добавить(ТипДенежныхСредствСтрокой);
					КонецЦикла;
					Если ОбщегоНазначенияСтоматология.ЕстьРеквизитДокумента("ВидыОплат",ДокументОбъект.Метаданные()) Тогда
						// Сортируем массив видов оплат
						МассивВидов              = СтроковыеФункцииКлиентСерверСтоматология.СортироватьМассивСтрок(МассивВидов);
						// Конкантенация строк массива
						ДокументОбъект.ВидыОплат = СтроковыеФункцииКлиентСерверСтоматология.ПолучитьСтрокуИзМассиваПодстрок(МассивВидов,",");
					КонецЕсли;
					// Устанавливаем флаг блокировки перезаполнения(переменная)
					Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.Прием") Тогда
					     ДокументОбъект.БлокироватьВызовПерезаполненияСуммыОплачено = Истина;   
						 
						 Если ТипЗнч(ДокументОплаты) = Тип("ДокументОбъект.ПоступлениеДенежныхСредств") 
							 ИЛИ ТипЗнч(ДокументОплаты) = Тип("ДокументОбъект.СписаниеДенежныхСредств") Тогда 
							 ДокументОбъект.Касса = ДокументОплаты.Касса;
						 КонецЕсли;
						 
					КонецЕсли;
					Если ПерепровестиДокумент(ДокументОбъект) Тогда
						ДокументОбъект.ДополнительныеСвойства.Вставить("НеПроверятьДатыЗапретаИзмененияДанных", Истина);
						ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);	
					Иначе
						ДокументОбъект.ДополнительныеСвойства.Вставить("НеПроверятьДатыЗапретаИзмененияДанных", Истина);
						ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
					КонецЕсли;
				КонецЕсли;		
			КонецЕсли;		
			Если ЗначениеЗаполнено(РасшифровкаПлатежа[А].ДокументАванса) Тогда	
				Если ТипЗнч(РасшифровкаПлатежа[А].ДокументАванса) = Тип("ДокументСсылка.ПланЛечения") Тогда
					ДокументОбъект               = РасшифровкаПлатежа[А].ДокументАванса.ПолучитьОбъект();
					ОстатокЗадолженности         = РегистрыНакопления.ВзаиморасчетыСКонтрагентами.ПолучитьЗадолженностьПоДокументу(РасшифровкаПлатежа[А].ДокументАванса,Неопределено,?(УдалениеПроведения,ДокументОплаты.Ссылка,Неопределено),Истина);
					// Обновляем значение реквизита сумма оплачено
					ДокументОбъект.СуммаОплачено = ДокументОбъект.СуммаДокумента - ОстатокЗадолженности;
					Если ДокументОбъект.СуммаОплачено > 0 Тогда 
						ДокументОбъект.Статус = Перечисления.СтатусыПланЛечения.Принят;
					КонецЕсли;	
					ДокументОбъект.ДополнительныеСвойства.Вставить("НеПроверятьДатыЗапретаИзмененияДанных", Истина);
					ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
				ИначеЕсли ТипЗнч(РасшифровкаПлатежа[А].ДокументАванса) = Тип("ДокументСсылка.НарядЗаказ") Тогда
					ДокументОбъект                        = РасшифровкаПлатежа[А].ДокументАванса.ПолучитьОбъект();
					ОстатокЗадолженностиПередКлиентом     = РегистрыНакопления.ВзаиморасчетыСКонтрагентами.ПолучитьЗадолженностьПоДокументу(РасшифровкаПлатежа[А].ДокументАванса,РасшифровкаПлатежа[А].ДокументАванса.Контрагент,?(УдалениеПроведения,ДокументОплаты.Ссылка,Неопределено),Истина);
					// Обновляем значение реквизита сумма оплачено 
					ДокументОбъект.СуммаОплаченоПродажи   = ДокументОбъект.СуммаПродажи - ОстатокЗадолженностиПередКлиентом; 
					Если ПерепровестиДокумент(ДокументОбъект) Тогда
						ДокументОбъект.ДополнительныеСвойства.Вставить("НеПроверятьДатыЗапретаИзмененияДанных", Истина);
						ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);	
					Иначе
						ДокументОбъект.ДополнительныеСвойства.Вставить("НеПроверятьДатыЗапретаИзмененияДанных", Истина);
						ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;		
	КонецЕсли;
КонецПроцедуры

// Получить признак необходимости перепроведения указанного документа
Функция ПерепровестиДокумент(ДокументОбъект)	
	Перепровести = Ложь;
	//Если ОбщегоНазначенияСтоматология.ЕстьТабличнаяЧастьДокумента("СкидкиНаценки",ДокументОбъект.Метаданные()) Тогда
	//	Для Каждого СтрокаТ ИЗ ДокументОбъект.СкидкиНаценки Цикл
	//		Если СтрокаТ.НачислениеНаЛицевойСчетУдалить Тогда
	//			Перепровести = Истина;
	//			Прервать;
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
	Возврат Перепровести;			
КонецФункции

// Получить документы оплаты с видом операции оплата от клиента по документу реализации или оказания услуг 
Функция ПолучитьДокументыОплатыПоДокументуРеализации(ДокументОснованияСсылка,СтруктурнаяЕдиница = Неопределено, ВидОперации = Неопределено) Экспорт
	
	ЗапросВыборка = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеРасшифровкаПлатежа.Ссылка
	|ИЗ
	|	Документ.ПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеРасшифровкаПлатежа
	|ГДЕ
	|	ПоступлениеРасшифровкаПлатежа.ДокументОснования = &ДокументСсылка
	|	И ПоступлениеРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА
	|	И ВЫБОР
	|			КОГДА НЕ &ВидОперации = НЕОПРЕДЕЛЕНО
	|				ТОГДА ПоступлениеРасшифровкаПлатежа.Ссылка.ВидОперации = &ВидОперации
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеРасшифровкаПлатежа.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка
	|ИЗ
	|	Документ.СписаниеДенежныхСредств.РасшифровкаПлатежа КАК СписаниеДенежныхСредствРасшифровкаПлатежа
	|ГДЕ
	|	СписаниеДенежныхСредствРасшифровкаПлатежа.ДокументОснования = &ДокументСсылка
	|	И СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА
	|	И ВЫБОР
	|			КОГДА НЕ &ВидОперации = НЕОПРЕДЕЛЕНО
	|				ТОГДА СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.ВидОперации = &ВидОперации
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка");	
	ЗапросВыборка.УстановитьПараметр("ДокументСсылка"    ,ДокументОснованияСсылка);
    ЗапросВыборка.УстановитьПараметр("СтруктурнаяЕдиница",СтруктурнаяЕдиница);	
	ЗапросВыборка.УстановитьПараметр("ВидОперации"       ,ВидОперации);
	
	Возврат  ЗапросВыборка.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

 // Функция вернет остатко на ЛС клиента
 //
Функция ПолучитьОстаткиНаЛицевыхСчетахКонтрагента(Контрагент
	                                              ,Период = Неопределено
	                                              ,НеУчитыватьРегистратор = Неопределено
												  ,СтруктурнаяЕдиница = Неопределено
												  ,ВидСчета = Неопределено
												  ,ВозвратТолькоСуммы = Ложь) Экспорт
												  
	Возврат РегистрыНакопления.ДенежныеСредстваНаЛицевыхСчетах.ПолучитьОстаткиНаЛицевыхСчетахКонтрагента(Контрагент,Период,НеУчитыватьРегистратор,СтруктурнаяЕдиница,ВидСчета,ВозвратТолькоСуммы);	
КонецФункции

// Функция вернет остатко денежных средств по переданным параметрам
Функция ПолучитьОстаткоДенежныхСредств(Период = Неопределено	                               
									  ,БанковскийСчетКасса  = Неопределено
									  ,НеУчитываемыйРегистратор = Неопределено) Экспорт
									  
	Возврат РегистрыНакопления.ДенежныеСредства.ПолучитьОстаткоДенежныхСредств(Период,БанковскийСчетКасса,НеУчитываемыйРегистратор);								  
КонецФункции

#КонецОбласти
